Repository: leoaretakis/brainup-webpage
Catalog: src/locales/*/messages.po
Languages: pt

source: 10am - 1pm
pt: 10h - 13h

source: 2:30pm - 7:30pm
pt: 14h30 - 19h30

source: About us
pt: Sobre nós

source: Address
pt: Morada

source: BrainUp is a tutoring center focused on students from the 1º, 2º e 3º cycles of primary school and high school (Portugal).
pt: O BrainUp é um centro de estudo dedicado aos alunos dos 1º, 2º e 3º ciclos e do secundário.

source: Contact us
pt: Contacte-nos

source: Contacts
pt: Contactos

source: Evolve your brain with us!
pt: Evoluí o teu cérebro connosco!

source: Focused on adults, the classes aim to consolidate and aquire knowledge and competence on languages - Porguguese, English and French. We provide Porguese classes for foreigners.
pt: Destinam-se a adultos e visam a aquisição e a consolidação de conhecimentos e competências linguísticas - Português, Inglês e Francês. Disponibilizamos aulas de Português a cidadãos estrangeiros.

source: Help students elaborate their homework, solve training fiches, clarify questions and preparations for the tests, exams, and portuguese national exams.
pt: Permite auxiliar os alunos na elaboração dos trabalhos de casa, na resolução de fichas formativas, no esclarecimento de dúvidas e na preparação para a realização dos testes, das provas de aferição e dos exames nacionais.

source: Individual tutoring - 1st to 12th school years
pt: Explicações individuais - 1º ao 12º

source: Language classes for adults
pt: Aulas de línguas para adultos

source: Log in
pt: Aceder

source: Loggin off...
pt: Desconectando-se...

source: Monday to Friday
pt: Segunda a Sexta

source: More detailed and personalized assistance on the disciplines, aiming apprenticeship development, betterment of grades and preparation for tests, exams and portuguese national exams.
pt: Permitem um acompanhamento mais detalhado e personalizado das disciplinas, visando o desenvolvimento de aprendizagens, a melhoria/recuperação das notas e a preparação para a realização das provas de aferição e dos exames nacionais.

source: More photos
pt: Ver mais fotos

source: Music classes - Guitar
pt: Aulas de música - Viola/guitarra

source: Our services
pt: Conheça nossos serviços

source: Reinforce musical learning and giving leisure time to the students, the center provides a music teacher for those interested in guitar learning. The scheduling of the classes are done weekly, according with the availability of the teacher.
pt: De forma a reforçar as aprendizagens dos alunos e a proporcionar-lhes um tempo de lazer, o centro disponibiliza um professor para aulas de música (viola/guitarra). A marcação das aulas é feita semanalmente, consoante a disponibilidade do professor.

source: Saturday
pt: Sábado

source: Services
pt: Serviços

source: Study rooms - 1st to 9th cycles of primary school (Portugal)
pt: Salas de estudo - 1º ao 9º

source: Study rooms, individual tutoring and more!
pt: Sala de estudo, explicações individuais, e mais!

source: The center has a mission of leveraging the development of the students' skills regarding academic, personal and social growth, instilling in them the appreciation for knowledge and the sense of responsability and self improvement.
pt: O centro tem por missão proporcionar o desenvolvimento das capacidades dos alunos referentes ao crescimento académico, pessoal e social, incutindo-lhes o apreço pelo conhecimento e o sentido de exigência e responsabilidade.

source: Time table
pt: Horários

source: Tutoring center
pt: Centro de estudo

source: We provide study room services, individual or group tutoring, pedagogical and extracurricular activities.
pt: Dispomos dos serviços de sala de estudo, explicações individuais e/ou em grupo, atividades pedagógicas e atividades extracurriculares.
